In [1]:
%matplotlib inline
import pandas as pd

## Assignment 14-15

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [4]:
c=titles['title'].count
c

<bound method Series.count of 0                          Tasveer Mere Sanam
1                                    Only You
2                        El pueblo del terror
3                                     Machine
4                                        MARy
                         ...
244909    Black Butterfly in a Colorful World
244910          Hua fei hua wu chun man cheng
244911                   Nippon dabi katsukyu
244912          Under Siege 2: Dark Territory
244913              She Must Be Seeing Things
Name: title, Length: 244914, dtype: object>

There are total 244913 movies listed in the data frame

### What are the earliest two films listed in the titles dataframe?

In [5]:
m=titles.sort_values('year')
m.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

Above are two earliest films in the title

### How many movies have the title "Hamlet"?

In [6]:
ch=titles[(titles['title']=='Hamlet')]
ch.shape[0]

20

There are total 20 movies named 'hamlet'

### How many movies are titled "North by Northwest"?

In [7]:
north=titles[(titles['title']=="North by Northwest")]
north.shape[0]

1

There is only 1 movie named 'North by Northwest'

### When was the first movie titled "Hamlet" made?

In [9]:
m=titles[(titles['title']=="Hamlet")].sort_values('year')
m.head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
m=titles[(titles['title']=="Treasure Island")].sort_values('year')
m

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [14]:
yr=titles[(titles['year'] == 1950)]
yr

                          title  year
189          La soif des hommes  1950
268            Sohrab at Rustum  1950
308                       Gemma  1950
314                Rasuna valea  1950
524          Trial Without Jury  1950
...                         ...   ...
244200               Inmaculada  1950
244362        Golden Salamander  1950
244440  Prisoners in Petticoats  1950
244470  The Golden Gloves Story  1950
244820                 Doctor X  1950

[1113 rows x 2 columns]

### How many movies were made in the year 1960?

In [ ]:
yr1960=titles[(titles['year'] == 1960)]
yr1960

### How many movies were made from 1950 through 1959?

In [40]:
bet=titles[(titles['year'] == 1950) | (titles['year'] == 1959)].sort_values('year')
bet.shape[0]
bet

                                       title  year
121364                       Prima comunione  1950
136969                  Pancho Villa Returns  1950
135659  Kami ang Sugatan (Wings Over Bataan)  1950
135315                        Ginza Sanshiro  1950
135242                     Une nuit de noces  1950
...                                      ...   ...
44574        Zwervers in het land der dromen  1959
135039               Ama no bakemono yashiki  1959
134895                          Shi xiong di  1959
136169                        Heures chaudes  1959
168                  Vetar je stao pred zoru  1959

[2628 rows x 2 columns]

these are 2628 movies betn the years 1950 and 1959

In [49]:
datacast=pd.read_csv('cast.csv')
datacast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### In what years has a movie titled "Batman" been released?

In [55]:
batman=datacast[datacast['title']=='Batman']
batman.head()
allch=batman['character'].unique()
total=len(allch)
total

103

### How many roles were there in the movie "Inception"?

In [52]:
inception=datacast[datacast['title']=='Inception']
inception.head()

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
197877,Inception,2010,Ken Bhan,actor,Mombasan Gambler,NaN
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0

In [53]:
allc=inception['character'].unique()
total=len(allc)
total

56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [58]:
d10=datacast[datacast['n'].isnull()]
d10.iloc[:,5:].size

1458573

### But how many roles in the movie "Inception" did receive an "n" value?

In [124]:
cast=datacast[(datacast['title']=="Inception")&(datacast['n']!='NaN')].sort_values('n')
cast

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

             title  year                  name     type         character    n
590576   Inception  2010     Leonardo DiCaprio    actor              Cobb  1.0
859993   Inception  2010  Joseph Gordon-Levitt    actor            Arthur  2.0
3387147  Inception  2010            Ellen Page  actress           Ariadne  3.0
940923   Inception  2010             Tom Hardy    actor             Eames  4.0
2406531  Inception  2010          Ken Watanabe    actor             Saito  5.0
...            ...   ...                   ...      ...               ...  ...
2796449  Inception  2010        Youlanda Davis  actress  Mombasan Cashier  NaN
2852164  Inception  2010        Julie Eagleton  actress       Stockbroker  NaN
2950644  Inception  2010       Natalie Goldwin  actress     LAX Passenger  NaN
3054447  Inception  2010    Marguerite Insolia  actress          Reporter  NaN
3149397  Inception  2010       Leticia LaBelle  actress    Airport Patron  NaN

[78 rows x 6 columns]

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [121]:
cast=datacast[(datacast['title']=="North by Northwest")&(datacast['n']!='NaN')].sort_values('n')
cast

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\ops\array_ops.py:253: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  res_values = method(rvalues)

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
...,...,...,...,...,...,...
3441077,North by Northwest,1959,Maudie Prickett,actress,Elsie - Maid,NaN
3577128,North by Northwest,1959,Doris Singh,actress,First United Nations Receptionist,NaN
3599912,North by Northwest,1959,Helen Spring,actress,Bidder,NaN
3739133,North by Northwest,1959,Susan Whitney,actress,Attendant,NaN
3751311,North by Northwest,1959,Paula Winslowe,actress,Woman at Auction,NaN

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [117]:
cast=datacast[(datacast['title']=="Sleuth")&(datacast['year']==1972)].sort_values('n')
cast

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [116]:
cast=datacast[(datacast['title']=="Sleuth")&(datacast['year']==2007)].sort_values('n')
cast

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [61]:
datacast[(datacast['title']=='Hamlet') &(datacast['year']==1921)].character.shape[0]

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [62]:
datacast[(datacast['title']=='Hamlet') &(datacast['year']==1996)].character.shape[0]

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [63]:
datacast[(datacast['title']=='Hamlet')].character.shape[0]

342

### How many people have played an "Ophelia"?

In [73]:
o=datacast[datacast['character']=='Ophelia'].character.shape[0]
o

117

In [74]:
o=datacast[datacast['character']=='Ophelia'].count()
o

title        117
year         117
name         117
type         117
character    117
n             60
dtype: int64

117 people had played ophelia

### How many people have played a role called "The Dude"?

In [72]:
dude=datacast[datacast['character']=='The Dude'].character.shape[0]
dude

19

19 people had played the dude

### How many people have played a role called "The Stranger"?

In [75]:
strange=datacast[datacast['character']=='The Stranger'].character.shape[0]
strange

212

212 people had played the stanger

### How many roles has Sidney Poitier played throughout his career?

In [76]:
actor=datacast[datacast['name']=='Sidney Poitier'].shape[0]
actor

43

Sidney Poitier played 43 roles

### How many roles has Judi Dench played?

In [77]:
actor=datacast[datacast['name']=='Judi Dench'].shape[0]
actor

55

Judi Dench played 55 roles

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [92]:
acc=datacast[(datacast['year']<=1949) & (datacast['year']>=1940)].sort_values('year')
cary=datacast[((datacast['name']=='Cary Grant') & (datacast['n']==2)) & ((datacast['year']<=1949) & (datacast['year']>=1940))].sort_values('year')
cary

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

2 supporting roles

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [98]:
acc=datacast[(datacast['year']<=1949) & (datacast['year']>=1940)].sort_values('year')
cary=datacast[((datacast['name']=='Cary Grant') & (datacast['n']==1)) & ((datacast['year']<=1949) & (datacast['year']>=1940))].sort_values('year')
cary.name.count()

18

18 leading roles

### How many roles were available for actors in the 1950s?

In [102]:
roles=datacast[(datacast['type']=='actor')&((datacast['year']<=1950) & (datacast['year']>=1959))].shape[0]
roles

0

no roles in this given decade

### How many roles were available for actresses in the 1950s?

In [103]:
roles=datacast[(datacast['type']=='actresses')&((datacast['year']<=1950) & (datacast['year']>=1959))].shape[0]
roles

0

no roles in this given decade

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [108]:
lol=datacast[(datacast['n']==1)&(datacast['year']<=1980)]
lol.type.count()
#OR
lol.shape[0]

65140

65140 roles

### How many non-leading roles were available through from the beginning of film history through 1980?

In [109]:
lol=datacast[(datacast['n']==2)&(datacast['year']<=1980)]
lol.type.count()
#OR
lol.shape[0]

61395

61395 non leading roles

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?